; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 315042 2 1 4 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph3 - mode
	thermograph2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Phenomenon6)
	(pointing satellite1 Planet7)
	(have_image Phenomenon3 thermograph3)
	(have_image Phenomenon4 spectrograph1)
	(have_image Star5 thermograph3)
	(have_image Phenomenon6 thermograph3)
	(have_image Planet7 spectrograph1)
	(have_image Planet8 thermograph3)
))

)

; plan
1. (turn_to satellite1 planet7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet7)
   goals met: 1 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
3. (turn_to satellite0 star2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star2)
   goals met: 1 of 8
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 8
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 8
6. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 0 of 8
7. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 0 of 8
8. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 1 of 8
9. (take_image satellite0 star5 instrument0 thermograph3)
   added: (have_image star5 thermograph3)
   goals met: 2 of 8
10. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 1 of 8
11. (turn_to satellite0 phenomenon6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 8
12. (turn_to satellite1 star2 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star2)
   goals met: 2 of 8
13. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 3 of 8
14. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 3 of 8
15. (turn_to satellite0 phenomenon4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon4)
   goals met: 2 of 8
16. (turn_to satellite1 planet8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet8)
   goals met: 2 of 8
17. (take_image satellite0 phenomenon4 instrument0 spectrograph1)
   added: (have_image phenomenon4 spectrograph1)
   goals met: 3 of 8
18. (take_image satellite1 planet8 instrument1 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 4 of 8
19. (turn_to satellite0 phenomenon6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 8
20. (turn_to satellite1 planet7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet7)
   goals met: 6 of 8
21. (turn_to satellite0 phenomenon3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon3)
   goals met: 5 of 8
22. (take_image satellite0 phenomenon3 instrument0 thermograph3)
   added: (have_image phenomenon3 thermograph3)
   goals met: 6 of 8
23. (turn_to satellite0 phenomenon6 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 phenomenon6)
   goals met: 7 of 8
24. (turn_to satellite0 planet7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet7)
   goals met: 6 of 8
25. (take_image satellite0 planet7 instrument0 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 7 of 8
26. (turn_to satellite0 phenomenon6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon6)
   goals met: 8 of 8
